"""
Выпонил: Карякин Дмитрий - Python
Задания, необходимо написать код:
Python
# 1. Составить алгоритм: если введенное число больше 7, то вывести “Привет”"""

while True: #запускаем бесконечный цикл
    try: #отлавливаем исключения
        chislo = int(input("Введите число:"))
        if chislo > 7:   #проверяем подходит ли под условие
            print("Привет")
            break #выход из цикла
        else:
            print("Введите другое число!") #если условие "число больше 7" не подходит
    except ValueError as e: #если ошибка выводим сообщение.
        print("Ошибка ввода! Введите числовое значение!")


"""Задание 2: 
Составить алгоритм: если введенное имя совпадает с Вячеслав, то вывести “Привет, Вячеслав”, если нет, то вывести "Нет такого имени" """


while True: #запускаем бесконечный цикл
    name = input("Введите имя: \n"
                 "(для выхода из циакла введите имя Вячеслав)\n")
    if name == "Вячеслав":
        print("Привет, Вячеслав")
        break
    else:
        print("Нет такого имени")


"""Задание 3:
Составить алгоритм: на входе есть числовой массив, необходимо вывести элементы массива кратные 3 """
while True:
    try:  # отлавливаем исключения
        spisok = list(map(int, (input("Введите массив чисел через пробел:").split()))) # преобразуем строку в масив - элементы масива делаем числами - создаём список из масива
        krat_3 = [] #объявляем пустой список
        if len(spisok) > 0: # защита от пустого ввода
            for num in spisok: # перебираем элементы списка
                if num % 3 == 0: # проверяем элемент на кратность 3м
                    krat_3.append(str(num)) #добавляем элемент в числа кратные 3-м
            if len(krat_3) > 0: # провера наличия кратных элементов
                print(" ".join(krat_3)) #объединяем все строки в одну строку
                break
            else:
                print("Элементы массива кратные 3 не найдены!")
        else:
            print("Ошибка! Введен пустой список")
    except ValueError as e:  # если ошибка выводим сообщение.
        print("Ошибка ввода! Введите массив из числовых значений!")
